; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-6-291)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p3-4 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	p2-5 - location
	p1-2 - location
	p0-1 - location
	p0-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s5)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s0)
	(at package2 s0)
	(at package3 s4)
	(at package4 s1)
	(at package5 s4)
	(at package6 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 7)
	(= (time-to-walk p3-4 s3) 7)
	(= (time-to-walk s4 p3-4) 11)
	(= (time-to-walk p3-4 s4) 11)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 11)
	(= (time-to-walk p5-0 s5) 11)
	(= (time-to-walk s0 p5-0) 1)
	(= (time-to-walk p5-0 s0) 1)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 9)
	(= (time-to-walk p5-1 s5) 9)
	(= (time-to-walk s1 p5-1) 2)
	(= (time-to-walk p5-1 s1) 2)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 8)
	(= (time-to-walk p5-4 s5) 8)
	(= (time-to-walk s4 p5-4) 2)
	(= (time-to-walk p5-4 s4) 2)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 11)
	(= (time-to-walk p2-5 s2) 11)
	(= (time-to-walk s5 p2-5) 2)
	(= (time-to-walk p2-5 s5) 2)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 2)
	(= (time-to-walk p1-2 s1) 2)
	(= (time-to-walk s2 p1-2) 1)
	(= (time-to-walk p1-2 s2) 1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 7)
	(= (time-to-walk p0-1 s0) 7)
	(= (time-to-walk s1 p0-1) 4)
	(= (time-to-walk p0-1 s1) 4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 1)
	(= (time-to-walk p0-2 s0) 1)
	(= (time-to-walk s2 p0-2) 10)
	(= (time-to-walk p0-2 s2) 10)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 4)
	(= (time-to-drive s4 s3) 4)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 1)
	(= (time-to-drive s3 s2) 1)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 4)
	(= (time-to-drive s4 s2) 4)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 6)
	(= (time-to-drive s5 s2) 6)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 2)
	(= (time-to-drive s3 s1) 2)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 8)
	(= (time-to-drive s4 s1) 8)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 8)
	(= (time-to-drive s5 s1) 8)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 2)
	(= (time-to-drive s0 s5) 2)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 10)
	(= (time-to-drive s3 s5) 10)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 9)
	(= (time-to-drive s4 s5) 9)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 5)
	(= (time-to-drive s1 s0) 5)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 3)
	(= (time-to-drive s2 s0) 3)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s2)
	(at driver3 s0)
	(at truck4 s1)
	(at truck5 s4)
	(at package1 s0)
	(at package2 s2)
	(at package3 s1)
	(at package4 s0)
	(at package5 s0)
	(at package6 s2)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 11
2. (drive-truck truck3 s1 s4 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 0 to 80
   goals met: 3 of 11
3. (load-truck package3 truck3 s4)
   deleted: (at package3 s4)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 11
4. (load-truck package5 truck3 s4)
   deleted: (at package5 s4)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 3 of 11
5. (drive-truck truck3 s4 s1 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (fuel-used) from 80 to 184
   goals met: 3 of 11
6. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 4 of 11
7. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 11
8. (load-truck package6 truck3 s1)
   deleted: (at package6 s1)
   added: (in package6 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 4 of 11
9. (drive-truck truck3 s1 s4 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 184 to 312
   goals met: 4 of 11
10. (drive-truck truck3 s4 s2 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (fuel-used) from 312 to 376
   goals met: 4 of 11
11. (unload-truck package6 truck3 s2)
   deleted: (in package6 truck3)
   added: (at package6 s2)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 5 of 11
12. (drive-truck truck3 s2 s0 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 376 to 415
   goals met: 5 of 11
13. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 11
14. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 5 of 11
15. (unload-truck package4 truck3 s0)
   deleted: (in package4 truck3)
   added: (at package4 s0)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 6 of 11
16. (unload-truck package5 truck3 s0)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 11
17. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 415 to 448
   goals met: 7 of 11
18. (drive-truck truck1 s3 s5 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 448 to 548
   goals met: 7 of 11
19. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 11
20. (drive-truck truck3 s2 s4 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 548 to 588
   goals met: 8 of 11
21. (disembark-truck driver3 truck1 s5)
   deleted: (driving driver3 truck1)
   added: (at driver3 s5) (empty truck1)
   goals met: 8 of 11
22. (walk driver3 s5 p5-0)
   deleted: (at driver3 s5)
   added: (at driver3 p5-0)
   goals met: 8 of 11
23. (walk driver3 p5-0 s0)
   deleted: (at driver3 p5-0)
   added: (at driver3 s0)
   goals met: 9 of 11
24. (drive-truck truck3 s4 s5 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 588 to 678
   goals met: 9 of 11
25. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 9 of 11
26. (board-truck driver1 truck5 s5)
   deleted: (at driver1 s5) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 9 of 11
27. (drive-truck truck5 s5 s4 driver1)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   changed: (fuel-used) from 678 to 768
   goals met: 10 of 11
28. (disembark-truck driver1 truck5 s4)
   deleted: (driving driver1 truck5)
   added: (at driver1 s4) (empty truck5)
   goals met: 11 of 11
